---
kind: other
id: Methods.T:Autodesk.Revit.DB.FilterStringEquals
source: html/73a4615f-0f50-7274-d005-6ef82e621c4b.htm
---
# FilterStringEquals Methods

Derived classes override this method to implement the test that determines
 whether the two given string values satisfy the desired condition or not.